node {
  name: "input_state"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 7
        }
        dim {
          size: 6
        }
        dim {
          size: 12
        }
      }
    }
  }
}
node {
  name: "input_training"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "conv/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\014\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "conv/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.049875468015670776
      }
    }
  }
}
node {
  name: "conv/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.049875468015670776
      }
    }
  }
}
node {
  name: "conv/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "conv/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "conv/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "conv/kernel/Initializer/random_uniform/max"
  input: "conv/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
}
node {
  name: "conv/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "conv/kernel/Initializer/random_uniform/RandomUniform"
  input: "conv/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
}
node {
  name: "conv/kernel/Initializer/random_uniform"
  op: "Add"
  input: "conv/kernel/Initializer/random_uniform/mul"
  input: "conv/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
}
node {
  name: "conv/kernel"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 12
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "conv/kernel"
    }
  }
}
node {
  name: "conv/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "conv/kernel"
  device: "/device:GPU:0"
}
node {
  name: "conv/kernel/Assign"
  op: "AssignVariableOp"
  input: "conv/kernel"
  input: "conv/kernel/Initializer/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv/kernel"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv/dilation_rate"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "conv/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv/Conv2D"
  op: "Conv2D"
  input: "input_state"
  input: "conv/Conv2D/ReadVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "conv_bn/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 7
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv_bn/gamma"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "conv_bn/gamma"
    }
  }
}
node {
  name: "conv_bn/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "conv_bn/gamma"
  device: "/device:GPU:0"
}
node {
  name: "conv_bn/gamma/Assign"
  op: "AssignVariableOp"
  input: "conv_bn/gamma"
  input: "conv_bn/gamma/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv_bn/gamma"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 7
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv_bn/beta"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "conv_bn/beta"
    }
  }
}
node {
  name: "conv_bn/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "conv_bn/beta"
  device: "/device:GPU:0"
}
node {
  name: "conv_bn/beta/Assign"
  op: "AssignVariableOp"
  input: "conv_bn/beta"
  input: "conv_bn/beta/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv_bn/beta"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 7
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv_bn/moving_mean"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "conv_bn/moving_mean"
    }
  }
}
node {
  name: "conv_bn/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "conv_bn/moving_mean"
  device: "/device:GPU:0"
}
node {
  name: "conv_bn/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "conv_bn/moving_mean"
  input: "conv_bn/moving_mean/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv_bn/moving_mean"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 7
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv_bn/moving_variance"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "conv_bn/moving_variance"
    }
  }
}
node {
  name: "conv_bn/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "conv_bn/moving_variance"
  device: "/device:GPU:0"
}
node {
  name: "conv_bn/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "conv_bn/moving_variance"
  input: "conv_bn/moving_variance/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv_bn/moving_variance"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/cond/Squeeze"
  op: "Squeeze"
  input: "input_training"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
      }
    }
  }
}
node {
  name: "conv_bn/cond"
  op: "If"
  input: "conv_bn/cond/Squeeze"
  input: "conv_bn/gamma"
  input: "conv_bn/beta"
  input: "conv_bn/moving_mean"
  input: "conv_bn/moving_variance"
  input: "conv/Conv2D"
  device: "/device:GPU:0"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
        i: 1
        i: 2
        i: 3
        i: 4
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "conv_bn_cond_false_33"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 7
          }
          dim {
            size: 6
          }
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 7
          }
        }
        shape {
          dim {
            size: 7
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "conv_bn_cond_true_32"
      }
    }
  }
}
node {
  name: "conv_bn/cond/Identity"
  op: "Identity"
  input: "conv_bn/cond"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_1"
  op: "Identity"
  input: "conv_bn/cond:1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_2"
  op: "Identity"
  input: "conv_bn/cond:2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_3"
  op: "Identity"
  input: "conv_bn/cond:3"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_4"
  op: "Identity"
  input: "conv_bn/cond:4"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_5"
  op: "Identity"
  input: "conv_bn/cond:5"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_6"
  op: "Identity"
  input: "conv_bn/cond:6"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_7"
  op: "Identity"
  input: "conv_bn/cond:7"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_8"
  op: "Identity"
  input: "conv_bn/cond:8"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "conv_bn/cond/Identity_9"
  op: "Identity"
  input: "conv_bn/cond:9"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "conv_bn/cond_1/Squeeze"
  op: "Squeeze"
  input: "input_training"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
      }
    }
  }
}
node {
  name: "conv_bn/cond_1"
  op: "StatelessIf"
  input: "conv_bn/cond_1/Squeeze"
  device: "/device:GPU:0"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "conv_bn_cond_1_false_102"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "conv_bn_cond_1_true_101"
      }
    }
  }
}
node {
  name: "conv_bn/cond_1/Identity"
  op: "Identity"
  input: "conv_bn/cond_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg/sub/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg/sub"
  op: "Sub"
  input: "conv_bn/AssignMovingAvg/sub/x"
  input: "conv_bn/cond_1/Identity"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv_bn/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "conv_bn/AssignMovingAvg/ReadVariableOp"
  input: "conv_bn/cond/Identity_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg/mul"
  op: "Mul"
  input: "conv_bn/AssignMovingAvg/sub_1"
  input: "conv_bn/AssignMovingAvg/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "conv_bn/moving_mean"
  input: "conv_bn/AssignMovingAvg/mul"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "conv_bn/moving_mean"
  input: "^conv_bn/AssignMovingAvg/AssignSubVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg_1/sub/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "conv_bn/AssignMovingAvg_1/sub/x"
  input: "conv_bn/cond_1/Identity"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "conv_bn/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "conv_bn/AssignMovingAvg_1/ReadVariableOp"
  input: "conv_bn/cond/Identity_2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "conv_bn/AssignMovingAvg_1/sub_1"
  input: "conv_bn/AssignMovingAvg_1/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg_1/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "conv_bn/moving_variance"
  input: "conv_bn/AssignMovingAvg_1/mul"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_bn/AssignMovingAvg_1/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "conv_bn/moving_variance"
  input: "^conv_bn/AssignMovingAvg_1/AssignSubVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_bn/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Relu"
  op: "Relu"
  input: "conv_bn/cond/Identity"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\000\001\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.03608439117670059
      }
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03608439117670059
      }
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "res0a_branch2a/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "res0a_branch2a/kernel/Initializer/random_uniform/max"
  input: "res0a_branch2a/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "res0a_branch2a/kernel/Initializer/random_uniform/RandomUniform"
  input: "res0a_branch2a/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Initializer/random_uniform"
  op: "Add"
  input: "res0a_branch2a/kernel/Initializer/random_uniform/mul"
  input: "res0a_branch2a/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
}
node {
  name: "res0a_branch2a/kernel"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2a/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 256
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "res0a_branch2a/kernel"
    }
  }
}
node {
  name: "res0a_branch2a/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "res0a_branch2a/kernel"
  device: "/device:GPU:0"
}
node {
  name: "res0a_branch2a/kernel/Assign"
  op: "AssignVariableOp"
  input: "res0a_branch2a/kernel"
  input: "res0a_branch2a/kernel/Initializer/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res0a_branch2a/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "res0a_branch2a/kernel"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res0a_branch2a/dilation_rate"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "res0a_branch2a/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "res0a_branch2a/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res0a_branch2a/Conv2D"
  op: "Conv2D"
  input: "Relu"
  input: "res0a_branch2a/Conv2D/ReadVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "bn0a_branch2a/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn0a_branch2a/gamma"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn0a_branch2a/gamma"
    }
  }
}
node {
  name: "bn0a_branch2a/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn0a_branch2a/gamma"
  device: "/device:GPU:0"
}
node {
  name: "bn0a_branch2a/gamma/Assign"
  op: "AssignVariableOp"
  input: "bn0a_branch2a/gamma"
  input: "bn0a_branch2a/gamma/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/gamma"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn0a_branch2a/beta"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn0a_branch2a/beta"
    }
  }
}
node {
  name: "bn0a_branch2a/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn0a_branch2a/beta"
  device: "/device:GPU:0"
}
node {
  name: "bn0a_branch2a/beta/Assign"
  op: "AssignVariableOp"
  input: "bn0a_branch2a/beta"
  input: "bn0a_branch2a/beta/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/beta"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn0a_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn0a_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn0a_branch2a/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn0a_branch2a/moving_mean"
  device: "/device:GPU:0"
}
node {
  name: "bn0a_branch2a/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "bn0a_branch2a/moving_mean"
  input: "bn0a_branch2a/moving_mean/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/moving_mean"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn0a_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn0a_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn0a_branch2a/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn0a_branch2a/moving_variance"
  device: "/device:GPU:0"
}
node {
  name: "bn0a_branch2a/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "bn0a_branch2a/moving_variance"
  input: "bn0a_branch2a/moving_variance/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/moving_variance"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Squeeze"
  op: "Squeeze"
  input: "input_training"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
      }
    }
  }
}
node {
  name: "bn0a_branch2a/cond"
  op: "If"
  input: "bn0a_branch2a/cond/Squeeze"
  input: "bn0a_branch2a/gamma"
  input: "bn0a_branch2a/beta"
  input: "bn0a_branch2a/moving_mean"
  input: "bn0a_branch2a/moving_variance"
  input: "res0a_branch2a/Conv2D"
  device: "/device:GPU:0"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
        type: DT_VARIANT
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
        i: 1
        i: 2
        i: 3
        i: 4
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "bn0a_branch2a_cond_false_153"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 7
          }
          dim {
            size: 6
          }
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
        shape {
          dim {
            size: 256
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "bn0a_branch2a_cond_true_152"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity"
  op: "Identity"
  input: "bn0a_branch2a/cond"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_1"
  op: "Identity"
  input: "bn0a_branch2a/cond:1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_2"
  op: "Identity"
  input: "bn0a_branch2a/cond:2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_3"
  op: "Identity"
  input: "bn0a_branch2a/cond:3"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_4"
  op: "Identity"
  input: "bn0a_branch2a/cond:4"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_5"
  op: "Identity"
  input: "bn0a_branch2a/cond:5"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_6"
  op: "Identity"
  input: "bn0a_branch2a/cond:6"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_7"
  op: "Identity"
  input: "bn0a_branch2a/cond:7"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_8"
  op: "Identity"
  input: "bn0a_branch2a/cond:8"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "bn0a_branch2a/cond/Identity_9"
  op: "Identity"
  input: "bn0a_branch2a/cond:9"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_VARIANT
    }
  }
}
node {
  name: "bn0a_branch2a/cond_1/Squeeze"
  op: "Squeeze"
  input: "input_training"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
      }
    }
  }
}
node {
  name: "bn0a_branch2a/cond_1"
  op: "StatelessIf"
  input: "bn0a_branch2a/cond_1/Squeeze"
  device: "/device:GPU:0"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "bn0a_branch2a_cond_1_false_222"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "bn0a_branch2a_cond_1_true_221"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/cond_1/Identity"
  op: "Identity"
  input: "bn0a_branch2a/cond_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg/sub/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg/sub"
  op: "Sub"
  input: "bn0a_branch2a/AssignMovingAvg/sub/x"
  input: "bn0a_branch2a/cond_1/Identity"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "bn0a_branch2a/AssignMovingAvg/ReadVariableOp"
  input: "bn0a_branch2a/cond/Identity_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg/mul"
  op: "Mul"
  input: "bn0a_branch2a/AssignMovingAvg/sub_1"
  input: "bn0a_branch2a/AssignMovingAvg/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "bn0a_branch2a/moving_mean"
  input: "bn0a_branch2a/AssignMovingAvg/mul"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/moving_mean"
  input: "^bn0a_branch2a/AssignMovingAvg/AssignSubVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg_1/sub/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "bn0a_branch2a/AssignMovingAvg_1/sub/x"
  input: "bn0a_branch2a/cond_1/Identity"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "bn0a_branch2a/AssignMovingAvg_1/ReadVariableOp"
  input: "bn0a_branch2a/cond/Identity_2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "bn0a_branch2a/AssignMovingAvg_1/sub_1"
  input: "bn0a_branch2a/AssignMovingAvg_1/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg_1/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "bn0a_branch2a/moving_variance"
  input: "bn0a_branch2a/AssignMovingAvg_1/mul"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn0a_branch2a/AssignMovingAvg_1/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "bn0a_branch2a/moving_variance"
  input: "^bn0a_branch2a/AssignMovingAvg_1/AssignSubVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn0a_branch2a/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Relu_1"
  op: "Relu"
  input: "bn0a_branch2a/cond/Identity"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\000\001\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.03608439117670059
      }
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03608439117670059
      }
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "res0a_branch2b/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "res0a_branch2b/kernel/Initializer/random_uniform/max"
  input: "res0a_branch2b/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "res0a_branch2b/kernel/Initializer/random_uniform/RandomUniform"
  input: "res0a_branch2b/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Initializer/random_uniform"
  op: "Add"
  input: "res0a_branch2b/kernel/Initializer/random_uniform/mul"
  input: "res0a_branch2b/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
}
node {
  name: "res0a_branch2b/kernel"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res0a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 256
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "res0a_branch2b/kernel"
    }
  }
}
node {
  name: "res0a_branch2b/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "res0a_branch2b/kernel"
  device: "/device:GPU:0"
}
node {
  name: "res0a_branch2b/kernel/Assign"
  op: "AssignVariableOp"
  input: "res0a_branch2b/kernel"
  input: "res0a_branch2b/kernel/Initializer/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res0a_branch2b/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "res0a_branch2b/kernel"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res0a_branch2b/dilation_rate"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
